{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing a new static image for the Combo Gift Sets card and listing related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files for reference.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH color variables for light/dark themes and global element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component rendering the HomePage only.",
  "frontend/src/components/BrandHeader.tsx": "Sticky branded header with SafeImage logo and navigation buttons that scroll to page sections.",
  "frontend/src/components/home/CuratedCategoriesSection.tsx": "Displays a grid of category cards using SafeImage and dynamic category image paths.",
  "frontend/src/components/home/GuidedFlowPanel.tsx": "Floating guided-flow assistant panel with open, close, and minimize controls.",
  "frontend/src/components/home/HeroSection.tsx": "Hero block with headline, CTAs, WhatsApp link, and SafeImage hero visuals.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Four-step process section with icons showing the gifting workflow.",
  "frontend/src/components/home/MasterCatalogueSection.tsx": "Catalogue CTA block offering view and download actions for the master catalogue PDF.",
  "frontend/src/components/home/WhatsAppCTASection.tsx": "Displays a WhatsApp call‑to‑action section with a chat button and supporting text.",
  "frontend/src/components/marketing/SafeImage.tsx": "Image component that shows a loading placeholder and renders a fallback UI if the image fails.",
  "frontend/src/config/pegasus.ts": "Defines gifting categories, asset paths, configuration settings, and helpers for building WhatsApp links and messages.",
  "frontend/src/features/guided-flow/CategoryCards.tsx": "Shows clickable category cards using predefined icons and invokes a callback on selection.",
  "frontend/src/features/guided-flow/ChatMessageList.tsx": "Displays system and user chat messages with styled bubbles and animations.",
  "frontend/src/features/guided-flow/CTAButtons.tsx": "Renders WhatsApp and catalogue action buttons, generating messages and handling view/download actions.",
  "frontend/src/features/guided-flow/GuidedFlow.tsx": "Core guided flow UI combining messages, quick replies, categories, and CTA buttons with scroll handling and restart logic.",
  "frontend/src/features/guided-flow/QuickReplies.tsx": "Renders a list of selectable quick‑reply buttons with labels and optional descriptions.",
  "frontend/src/features/guided-flow/types.ts": "Type definitions for guided‑flow steps, messages, answers, and flow state.",
  "frontend/src/features/guided-flow/useGuidedFlow.ts": "Implements guided‑flow state management, step transitions, message creation, and intent/category resolution.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Wrapper hook that exposes the backend actor and its fetching state for future backend integrations.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables for light and dark mode styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage layout with multiple marketing sections, footer, and guided flow panel.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project metadata, features, requirements, and configuration for the ongoing update."
}