{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and base theming for light and dark modes.",
  "frontend/index.html": "Base HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering HomePage.",
  "frontend/src/components/BrandHeader.tsx": "Header showing the Pegasus logo, brand name, and tagline with premium styling.",
  "frontend/src/config/pegasus.ts": "Central configuration for categories, company info, catalogue settings, and WhatsApp message helpers.",
  "frontend/src/features/guided-flow/CategoryCards.tsx": "Interactive grid of category selection cards with icons and hover effects.",
  "frontend/src/features/guided-flow/ChatMessageList.tsx": "Renders animated chat message bubbles for system and user messages.",
  "frontend/src/features/guided-flow/CTAButtons.tsx": "CTA component providing WhatsApp contact and catalogue actions with red‑themed styling.",
  "frontend/src/features/guided-flow/GuidedFlow.tsx": "Main guided‑flow controller rendering messages, quick replies, categories, CTAs, and restart logic.",
  "frontend/src/features/guided-flow/QuickReplies.tsx": "Renders a list of quick-reply buttons and triggers onSelect with each reply's value and label. Provides basic styling and optional descriptions.",
  "frontend/src/features/guided-flow/types.ts": "Defines TypeScript types for guided flow steps, messages, quick replies, and overall flow state. Centralizes step IDs and shared interfaces.",
  "frontend/src/features/guided-flow/useGuidedFlow.ts": "Implements guided flow state management, step transitions, and message creation logic. Contains the step configuration and answer-handling flow.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's Internet Identity, refreshing dependent queries when identity changes. Wraps react-query for actor retrieval.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity persistence, and AuthClient setup. Exposes state and helpers for authentication flow.",
  "frontend/src/hooks/useQueries.ts": "Thin wrapper exposing the actor and fetching status from useActor. Placeholder for future backend queries.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for theme colors and layout, supporting both light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then mounts App. Loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage layout with branding, the guided flow card, and a footer. Acts as the main UI entry point for the guided flow.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, fonts, shadows, animations, and plugin usage. Enables class-based dark mode and custom design tokens.",
  "project_state.json": "Defines project metadata, design constraints, and a list of existing features for a guided, chat-led B2B gifting website with a red Pegasus brand style."
}