{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report describing the Home navigation feature and related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping frontend file paths to their descriptions.",
  "frontend/index.css": "Tailwind base and utility imports with extensive CSS variable definitions for light and dark themes.",
  "frontend/index.html": "HTML entry point containing the root div and script loading the React app.",
  "frontend/src/App.tsx": "Root React component with hero header, Home button to reset chat flow, main guided flow container, and social footer.",
  "frontend/src/config/pegasus.ts": "Defines gifting categories, company config, catalogue info, and a helper to generate a WhatsApp link.",
  "frontend/src/features/guided-flow/CategoryCards.tsx": "Displays selectable category cards sourced from config with animated styling.",
  "frontend/src/features/guided-flow/ChatMessageList.tsx": "Renders system and user chat messages with animated entry and styled bubbles.",
  "frontend/src/features/guided-flow/CTAButtons.tsx": "Renders WhatsApp CTA and catalogue download button with corresponding click handlers.",
  "frontend/src/features/guided-flow/GuidedFlow.tsx": "Orchestrates chat steps, message display, interactive elements, scrolling, and restart controls.",
  "frontend/src/features/guided-flow/QuickReplies.tsx": "Shows quick reply buttons for step interactions, supporting labels and descriptions.",
  "frontend/src/features/guided-flow/types.ts": "Type definitions for guided flow steps, messages, replies, and flow state.",
  "frontend/src/features/guided-flow/useGuidedFlow.ts": "Manages the guided chat flow state, step transitions, user answers, and message history with restart and back-navigation support.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and restoring stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wrapper exposing the current backend actor and its loading state for future data queries.",
  "frontend/src/index.css": "Defines global Tailwind styles and a premium gold‑white theme using CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and mounts it to the DOM.",
  "frontend/tailwind.config.js": "Configures Tailwind with theme extensions, custom colors, animations, fonts, and plugins for the project.",
  "project_state.json": "Stores project metadata, features, requirements, and the current state of the Pegasus Gifting implementation."
}